# 1. Importing libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# importing dataframe 4.5: Products - Original Data
df_products = pd.read_csv(r'C:\Users\ideal\Task 4.5\02 Data\Original Data\products.csv', index_col = False)

In [3]:
path = r'C:\Users\ideal\Task 4.5'

In [4]:
df_products = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [5]:
# importing dataframe 4.5: orders - Prepared Data 
df_orders = pd.read_csv(r'C:\Users\ideal\Task 4.5\02 Data\Prepared Data\orders_wrangled.csv', index_col = False)

In [6]:
df_orders = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [7]:
# In this frame I did not see a reason why to keep the "Unnamed: 0" column, but I did keep it for now. I could/will get rid of it throug the .drop" option.
df_orders.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [8]:
# Creating a dataframe with mix-type coumns 

df_test = pd.DataFrame()

In [9]:
# Creating a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [10]:
df_test.head

<bound method NDFrame.head of     mix
0     a
1     b
2     1
3  True>

In [11]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [12]:
df_test['mix'] = df_test['mix'].astype('str')

# 2. df_products consistency check

## 2.1 Mixed-Type Data

In [13]:
# Checking for mixed types
for col in df_products.columns.tolist():
  weird = (df_products[[col]].applymap(type) != df_products[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_products[weird]) > 0:
    print (col)

product_name

In [14]:
# No mixed type variables found in this dataframe
df_products.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [15]:
df_products.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [16]:
# the max. price 99999.000000 seems not right, we'll change it to 0.99999
df_products.loc[df_products['prices'] == 99999.000000, 'prices'] = 0.99999

In [17]:
df_products.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      7.981820
std    14343.717401     38.316774       5.850282     66.937791
min        1.000000      1.000000       1.000000      0.999990
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  14900.000000

In [18]:
# after changing 99999.000000 to 0.99999, we got a new max. in prices max. = 14900.000000. Now we'll change 149000 to 1.49000
df_products.loc[df_products['prices'] == 14900.000000, 'prices'] = 1.49000

In [20]:
# 149000 substituted with 1.49000. New max. value = 25.000000
df_products.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      7.682009
std    14343.717401     38.316774       5.850282      4.200357
min        1.000000      1.000000       1.000000      0.999990
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000     25.000000

## 2.2 Missing Values

In [21]:
# 16 missing values found under product_name
df_products.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [22]:
df_nan = df_products[df_products['product_name'].isnull() == True]

In [23]:
# The 16 missing values before interfering - before addressing the missing vlaues:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [24]:
# Numbers of rows and columns before interfering
df_products.shape

(49693, 5)

In [25]:
# new dataframe with no missing values
df_products_clean = df_products[df_products['product_name'].isnull() == False]

In [26]:
# Number of rows and columns after interfering - deleting the missing values
df_products_clean.shape

(49677, 5)

## 2.3 Duplicates

In [27]:
df_dups = df_products_clean[df_products_clean.duplicated()]

In [28]:
# 5 duplicates found in the df_products dataset
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [29]:
# numbers before deleting duplicates
df_products_clean.shape

(49677, 5)

In [30]:
# new dataframe without duplicates
df_products_clean_no_dups = df_products_clean.drop_duplicates()

In [31]:
# numbers after deleting duplicates (5 rows deleted)
df_products_clean_no_dups.shape

(49672, 5)

# 3. df_orders consistency check

## 3.1 df.describe() on df_orders

In [32]:
df_orders.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [31]:
# 3.1 df.describe() on df_orders - After running the df.describe() function on my df_orders, two variables seem a bit off: "order_number" (if with this they mean the number of orders) and "days_since_last_order". In order_number I can see that the min. value is 1,  max. is 100,  and the 25% is 5, 50% is 11. On the other side,  in the "days_since_last_order" column I see that the minimum is 0, the max. is 30, while the 50% is 7, and the mean is 13.45. These numbers do not seems that right in the first look, if I know more about the data maybe it will make more sense.

## 3.2 Mixed-Type Data

In [33]:
for col in df_orders.columns.tolist():
  weird = (df_orders[[col]].applymap(type) != df_orders[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_orders[weird]) > 0:
    print (col)

In [34]:
# No mixed type variables found in this dataframe
df_orders.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

# 3.3 Missing Values

In [35]:
# 206209 missing values found under days_since_last_order
df_orders.isnull().sum()

Unnamed: 0                    0
order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

In [36]:
df_nan = df_orders[df_orders['days_since_last_order'].isnull() == True]

In [37]:
df_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [ ]:
# Even though there is a significant amount of cells that have no numbers (NaN), 206209 missing values found under days_since_last_order, I see a possible relation between that and the number 1 under the order_number column: It could be that they are all first-time buyers so there is no previous history to track anything.

In [38]:
df_dups = df_orders[df_orders.duplicated()]

In [39]:
# No duplictaed found
df_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

In [40]:
df_orders.shape

(3421083, 7)

# 4. Exporting Changes

In [ ]:
# Right now I am exporting only the "df_products_clean_no_dups" data frame because I did change the set a little bit. On the other hand, I did not change the already wrangled orders dataset.

In [41]:
df_products_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))